# Exploring a database

Let's practice on Pandas. Download the dataset ```chipotle.csv``` from JULIE and upload it to your workspace.

You can also request our <a href="https://full-stack-bigdata-datasets.s3.eu-west-3.amazonaws.com/Data+visualisation+et+collaboration/chipotle.csv" target="_blank">S3 Bucket</a> to access the dataset.

1. Import a library that allows to read data from a csv file

In [2]:
import pandas as pd

2. Import the dataset

In [3]:
data_df = pd.read_csv("chipotle.csv")

3. Look at the 10 first rows in the dataset

In [4]:
data_df.head(10)

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39
2,2,1,1,Nantucket Nectar,[Apple],$3.39
3,3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,6,3,1,Side of Chips,NaN,$1.69
7,7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [6]:
data_df.sample(10)

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
1583,1583,640,1,Chips and Tomatillo Green Chili Salsa,NaN,$2.95
1166,1166,481,2,Chicken Burrito,"[Fresh Tomato Salsa, Rice]",$17.50
4564,4564,1815,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25
506,506,212,2,Carnitas Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$23.50
817,817,338,1,Chicken Bowl,"[[Roasted Chili Corn Salsa (Medium), Fresh Tom...",$10.98
3861,3861,1548,2,Steak Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$18.50
2611,2611,1036,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Black Beans, Rice...",$10.98
1497,1497,608,1,Veggie Burrito,"[[Fresh Tomato Salsa (Mild), Roasted Chili Cor...",$8.49
4240,4240,1692,1,Canned Soft Drink,[Diet Coke],$1.25
594,594,244,1,Bottled Water,NaN,$1.50

4. What is the shape of the dataset ?

In [5]:
data_df.shape

(4622, 6)

5. Display all the columns of our dataset

In [7]:
data_df.columns.to_list()

['Unnamed: 0',
 'order_id',
 'quantity',
 'item_name',
 'choice_description',
 'item_price']

6. What is the most ordered item?

     *Indication: we will use ```groupby()``` & ```sort_values()```*

In [6]:
data_df.groupby("item_name")["quantity"].sum().sort_values(ascending=False)

item_name
Chicken Bowl                             761
Chicken Burrito                          591
Chips and Guacamole                      506
Steak Burrito                            386
Canned Soft Drink                        351
Chips                                    230
Steak Bowl                               221
Bottled Water                            211
Chips and Fresh Tomato Salsa             130
Canned Soda                              126
Chicken Salad Bowl                       123
Chicken Soft Tacos                       120
Side of Chips                            110
Veggie Burrito                            97
Barbacoa Burrito                          91
Veggie Bowl                               87
Carnitas Bowl                             71
Barbacoa Bowl                             66
Carnitas Burrito                          60
Steak Soft Tacos                          56
6 Pack Soft Drink                         55
Chips and Tomatillo Red Chili Salsa       50
Chicken Crispy Tacos                      50
Chips and Tomatillo Green Chili Salsa     45
Carnitas Soft Tacos                       40
Steak Crispy Tacos                        36
Chips and Tomatillo-Green Chili Salsa     33
Steak Salad Bowl                          31
Nantucket Nectar                          29
Chips and Tomatillo-Red Chili Salsa       25
Barbacoa Soft Tacos                       25
Chips and Roasted Chili Corn Salsa        23
Izze                                      20
Chips and Roasted Chili-Corn Salsa        18
Veggie Salad Bowl                         18
Barbacoa Crispy Tacos                     12
Barbacoa Salad Bowl                       10
Chicken Salad                              9
Veggie Soft Tacos                          8
Carnitas Crispy Tacos                      8
Burrito                                    6
Carnitas Salad Bowl                        6
Veggie Salad                               6
Steak Salad                                4
Bowl                                       4
Salad                                      2
Crispy Tacos                               2
Chips and Mild Fresh Tomato Salsa          1
Veggie Crispy Tacos                        1
Carnitas Salad                             1
Name: quantity, dtype: int64

7. How many items were ordered from Chipotle in total?

In [7]:
data_df["quantity"].sum()

4972

8. How much revenue has Chipotle made?
      
- First, convert ```item_price``` to a decimal number.
      
Look at ```item_price``` column, what do you see?

Let's find a way to get that ```$``` out of our way. We can do that by using <a href="https://bit.ly/2ClcdtN" target="_blank">str</a>
        
Let's now convert the ```series``` to ```float``` instead of string. We can use <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.astype.html" target="_blank">astype()</a> function
        `
- Then multiply the quantity sold by the price of the item, how much do you find? Round the result to two decimals
    
We can use the <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.round.html#pandas.Series.round" target="_blank">series.round()</a> function.

In [10]:
import numpy as np

In [8]:
#data_df.astype({'item_price':float})
data_df["item_price_numerique"] = data_df["item_price"].str.replace('$', '')

In [16]:
data_df["item_price_numerique"] =data_df.astype({'item_price_numerique': np.float16})["item_price_numerique"]

In [24]:
data_df["sale_amount"]=(data_df["item_price_numerique"] * data_df["quantity"])

In [25]:
data_df["sale_amount"].sum().round(decimals=2)

39237.32

9. What is the average revenue per order?

In [44]:
avg_sale = np.round(data_df.groupby("order_id")["sale_amount"].sum().mean(), decimals=2)
avg_sale

21.39

In [47]:
print(f'The average revenu per order is {avg_sale}$')

The average revenu per order is 21.39$